zephyrproject-rtos/zephyr/drivers/adc/adc_infineon_psoc4_sar.c
/*
 * Copyright (c) 2025 Infineon Technologies AG,
 * or an affiliate of Infineon Technologies AG.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT infineon_psoc4_adc

#include <zephyr/drivers/adc.h>
#include <zephyr/device.h>
#include <zephyr/devicetree.h>
#include <zephyr/logging/log.h>
#include <zephyr/sys/util.h>
#include <zephyr/drivers/clock_control/clock_control_ifx_cat1.h>

#define ADC_CONTEXT_USES_KERNEL_TIMER
#include "adc_context.h"

#include "cy_sar.h"
#include "cy_pdl.h"
#include "cy_gpio.h"
#include "cy_device.h"
#include "cyip_hsiom.h"

LOG_MODULE_REGISTER(psoc4_adc, CONFIG_ADC_LOG_LEVEL);

#define PSOC4_ADC_REF_INTERNAL_MV 1200U

/* SAR ADC acquisition timing:
 * PSoC4 SAR ADC clock runs at ~18 MHz.
 * One SAR clock period ≈ 55.5 ns.
 * Use 55 ns to ensure rounding up when converting time to ticks.
 */
#define PSOC4_ADC_ACQ_NS_PER_TICK 55U

/* PSoC4 SAR ADC sample time limits (hardware defined) */
#define PSOC4_ADC_MIN_ACQ_TICKS 3U
#define PSOC4_ADC_MAX_ACQ_TICKS 1023U

/* Number of hardware sample time registers in PSoC4 SAR ADC */
#define PSOC4_ADC_NUM_SAMPLE_TIMES 4U

/* Invalid sample time index */
#define PSOC4_ADC_INVALID_SAMPLE_TIME 0xFFU

#define PSOC4_ADC_MAX_PIN_NUM        64U /* Board total pins 0-63 */
#define PSOC4_ADC_GPIO_PINS_PER_PORT 8U  /* 8 pins per port */
#define PSOC4_ADC_SARMUX_PIN_MAX     7U  /* SARMUX port 2, pins 0-7 */

enum psoc4_adc_vref_src {
	PSOC4_ADC_VREF_INTERNAL = 0,
	PSOC4_ADC_VREF_VDDA = 1,
	PSOC4_ADC_VREF_VDDA_DIV_2 = 2,
	PSOC4_ADC_VREF_EXT = 3,
};

struct psoc4_adc_config {
	SAR_Type *base;
	enum psoc4_adc_vref_src vref_src;
	uint32_t vref_mv;
	void (*irq_func)(const struct device *dev);
	en_clk_dst_t clk_dst;
};

enum psoc4_adc_pin_routing {
	PSOC4_ADC_ROUTE_SARMUX,
	PSOC4_ADC_ROUTE_AMUXBUS_A,
	PSOC4_ADC_ROUTE_AMUXBUS_B,
};

struct psoc4_adc_channel_cfg {
	bool differential;
	uint8_t vplus;
	uint8_t vminus;
	uint8_t reference;
	uint8_t sample_time_idx;
	enum psoc4_adc_pin_routing vplus_routing;
	enum psoc4_adc_pin_routing vminus_routing;
	uint32_t sw_mask;
};

struct psoc4_adc_data {
	struct adc_context ctx;
	const struct device *dev;
	uint16_t *buffer;
	uint16_t *repeat_buffer;
	uint32_t channels;
	uint32_t channels_mask;
	struct ifx_cat1_clock clock;
	uint8_t resolution[CY_SAR_SEQ_NUM_CHANNELS];
	struct psoc4_adc_channel_cfg channel_cfg[CY_SAR_SEQ_NUM_CHANNELS];
	uint32_t sample_times[PSOC4_ADC_NUM_SAMPLE_TIMES];
	cy_stc_sar_config_t pdl_sar_cfg;
	cy_stc_sar_channel_config_t channel_configs[CY_SAR_SEQ_NUM_CHANNELS];
};

static const cy_stc_sar_config_t psoc4_sar_pdl_cfg_struct_default = {
	.vrefSel = CY_SAR_VREF_SEL_BGR,
	.vrefBypCapEn = true,
	.vrefMvValue = PSOC4_ADC_REF_INTERNAL_MV,
	.negSel = CY_SAR_NEG_SEL_VSSA_KELVIN,
	.power = CY_SAR_HALF_PWR,
	.singleEndedSigned = false,
	.differentialSigned = false,
	.trigMode = CY_SAR_TRIGGER_MODE_FW_ONLY,
	.eosEn = true,
	.sampleTime0 = 3,
	.sampleTime1 = 3,
	.sampleTime2 = 3,
	.sampleTime3 = 3,
};

static const cy_stc_sar_channel_config_t psoc4_default_channel_cfg = {
	.addr = CY_SAR_ADDR_SARMUX_0,
	.differential = false,
	.resolution = CY_SAR_MAX_RES,
	.avgEn = false,
	.sampleTimeSel = CY_SAR_SAMPLE_TIME_0,
	.rangeIntrEn = false,
	.satIntrEn = false,
#if (defined(CY_IP_M0S8PASS4A_SAR_VERSION) && (4U <= CY_IP_M0S8PASS4A_SAR_VERSION))
	.neg_addr = CY_SAR_NEG_ADDR_SARMUX_0,
	.negAddrEn = false,
#endif
};

static void adc_context_start_sampling(struct adc_context *ctx)
{
	struct psoc4_adc_data *data = CONTAINER_OF(ctx, struct psoc4_adc_data, ctx);
	const struct psoc4_adc_config *config = data->dev->config;

	data->repeat_buffer = data->buffer;
	Cy_SAR_StartConvert(config->base, CY_SAR_START_CONVERT_SINGLE_SHOT);
}

static void adc_context_update_buffer_pointer(struct adc_context *ctx, bool repeat_sampling)
{
	struct psoc4_adc_data *data = CONTAINER_OF(ctx, struct psoc4_adc_data, ctx);

	if (repeat_sampling) {
		data->buffer = data->repeat_buffer;
	}
}

/* Determine which routing method to use based on pin number */
static enum psoc4_adc_pin_routing psoc4_determine_routing(uint8_t pin)
{
	enum psoc4_adc_pin_routing routing;

	if (pin <= PSOC4_ADC_SARMUX_PIN_MAX) {
		routing = PSOC4_ADC_ROUTE_SARMUX;
	} else {
		/* AMUXBUS routing */
		routing = (pin % 2 == 0) ? PSOC4_ADC_ROUTE_AMUXBUS_A : PSOC4_ADC_ROUTE_AMUXBUS_B;
	}

	return routing;
}

/* Get GPIO port number based on pin number and routing method */
static uint32_t psoc4_get_gpio_port(uint8_t pin, enum psoc4_adc_pin_routing routing)
{
	uint32_t port;

	switch (routing) {
	case PSOC4_ADC_ROUTE_SARMUX:
		/* SARMUX pins are on port 2 */
		port = 2U;
		break;
	case PSOC4_ADC_ROUTE_AMUXBUS_A:
	case PSOC4_ADC_ROUTE_AMUXBUS_B:
		/* AMUXBUS pins */
		port = (pin / PSOC4_ADC_GPIO_PINS_PER_PORT);
		break;
	default:
		port = 2U;
		break;
	}

	return port;
}

/* Configure AMUXBUS splitter cells for proper analog signal routing */
static void psoc4_configure_amuxbus_splitter(enum psoc4_adc_pin_routing routing, uint32_t port)
{
	/* Select which AMUXBUS configuring A or B */
	cy_en_gpio_amuxselect_t amux_bus =
		(routing == PSOC4_ADC_ROUTE_AMUXBUS_A) ? CY_GPIO_AMUXBUSA : CY_GPIO_AMUXBUSB;

	/* Connect to global resource (GLR) - connects to ADC */
	cy_en_gpio_amuxconnect_t amux_connect = CY_GPIO_AMUX_GLR;

	/* Configure both splitter cells (0 and 1) for the selected AMUXBUS */
	for (cy_en_amux_split_t splitter_cell = AMUX_SPLIT_CTL_0; splitter_cell <= AMUX_SPLIT_CTL_1;
	     splitter_cell = (cy_en_amux_split_t)((uint32_t)splitter_cell + 1)) {

		/* Get current splitter configuration */
		cy_en_gpio_amuxconnect_t current_connect =
			Cy_GPIO_GetAmuxSplit(splitter_cell, amux_bus);

		/* Only update if different from desired configuration */
		if (current_connect != amux_connect) {
			Cy_GPIO_SetAmuxSplit(splitter_cell, amux_connect, amux_bus);
		}
	}
}

/* Convert Zephyr ADC acquisition time to hardware clock ticks */
static uint32_t psoc4_calculate_acq_ticks(uint32_t acquisition_time)
{
	uint32_t ticks;

	if (acquisition_time == ADC_ACQ_TIME_DEFAULT) {
		/* Use minimum acquisition time (3 ticks) for default */
		ticks = PSOC4_ADC_MIN_ACQ_TICKS;
	} else if (ADC_ACQ_TIME_UNIT(acquisition_time) == ADC_ACQ_TIME_TICKS) {
		ticks = ADC_ACQ_TIME_VALUE(acquisition_time);
	} else {
		/* Convert nanoseconds/microseconds to ADC clock ticks */
		uint32_t ns =
			ADC_ACQ_TIME_VALUE(acquisition_time) *
			((ADC_ACQ_TIME_UNIT(acquisition_time) == ADC_ACQ_TIME_MICROSECONDS) ? 1000U
											    : 1U);

