zephyrproject-rtos/zephyr/drivers/adc/adc_infineon_psoc4_sar.c
		/*
		 * Calculate ticks with ceiling division: (ns + tick_period - 1) / tick_period
		 * PSOC4_ADC_ACQ_NS_PER_TICK = 55 ns (18 MHz ADC clock ≈ 55.5 ns period)
		 * Ensures we round up to guarantee minimum acquisition time
		 */
		ticks = (ns + PSOC4_ADC_ACQ_NS_PER_TICK - 1U) / PSOC4_ADC_ACQ_NS_PER_TICK;
	}

	/*
	 * Clamp ticks to valid hardware range.
	 * PSoC4 SAR ADC hardware supports 3-1023 clock ticks for sampling.
	 */
	return CLAMP(ticks, PSOC4_ADC_MIN_ACQ_TICKS, PSOC4_ADC_MAX_ACQ_TICKS);
}

/* Find an available sample time slot (0-3) */
static uint8_t psoc4_find_sample_time_idx(struct psoc4_adc_data *data, uint32_t ticks)
{
	/*
	 * Find an available sample time slot (0-3).
	 * PSoC4 has 4 hardware sample time registers that can be shared between channels.
	 * This allows different channels to have different acquisition times.
	 */
	for (int i = 0; i < PSOC4_ADC_NUM_SAMPLE_TIMES; i++) {
		if (data->sample_times[i] == ticks || data->sample_times[i] == 0U) {
			data->sample_times[i] = ticks;
			return i; /* Return slot index (0-3) */
		}
	}

	/* No available slots found */
	return PSOC4_ADC_INVALID_SAMPLE_TIME;
}

static int psoc4_adc_channel_setup(const struct device *dev,
				   const struct adc_channel_cfg *channel_cfg)
{
	struct psoc4_adc_data *data = dev->data;
	uint8_t ch = channel_cfg->channel_id;
	uint32_t sw_mask = 0;

	/* Channel validation */
	if (ch >= CY_SAR_SEQ_NUM_CHANNELS) {
		LOG_ERR("Invalid channel ID: %u", ch);
		return -EINVAL;
	}

	if (channel_cfg->gain != ADC_GAIN_1) {
		LOG_ERR("Invalid gain: %d", channel_cfg->gain);
		return -EINVAL;
	}

	if (channel_cfg->reference != ADC_REF_INTERNAL && channel_cfg->reference != ADC_REF_VDD_1 &&
	    channel_cfg->reference != ADC_REF_VDD_1_2 &&
	    channel_cfg->reference != ADC_REF_EXTERNAL0) {
		LOG_ERR("Invalid reference: %d", channel_cfg->reference);
		return -EINVAL;
	}

	/* Input validation */
	if (channel_cfg->input_positive >= PSOC4_ADC_MAX_PIN_NUM) {
		LOG_ERR("Channel %u: invalid input_positive %u", ch, channel_cfg->input_positive);
		return -EINVAL;
	}

	if (channel_cfg->differential && channel_cfg->input_negative >= PSOC4_ADC_MAX_PIN_NUM) {
		LOG_ERR("Channel %u: invalid input_negative %u", ch, channel_cfg->input_negative);
		return -EINVAL;
	}

	data->channel_cfg[ch].differential = channel_cfg->differential;

	data->channel_cfg[ch].vplus = channel_cfg->input_positive;
	data->channel_cfg[ch].vplus_routing = psoc4_determine_routing(channel_cfg->input_positive);

	if (data->channel_cfg[ch].vplus_routing == PSOC4_ADC_ROUTE_SARMUX) {

		if (channel_cfg->input_positive > PSOC4_ADC_SARMUX_PIN_MAX) {
			LOG_ERR("Channel %u: SARMUX pin %u > max %u", ch,
				channel_cfg->input_positive, PSOC4_ADC_SARMUX_PIN_MAX);
			return -EINVAL;
		}

		uint32_t port =
			psoc4_get_gpio_port(channel_cfg->input_positive, PSOC4_ADC_ROUTE_SARMUX);
		/* SARMUX pins are on port 2, pins 0-7 directly mapped */
		uint32_t gpio_pin = channel_cfg->input_positive;

		GPIO_PRT_Type *port_base = Cy_GPIO_PortToAddr(port);

		if (!port_base) {
			LOG_ERR("Channel %u: Cannot get GPIO port for pin %u", ch,
				channel_cfg->input_positive);
			return -EINVAL;
		}

		/* Configure GPIO pin for analog input mode */
		Cy_GPIO_SetDrivemode(port_base, gpio_pin, CY_GPIO_DM_ANALOG);

		/*
		 * Configure SAR switch mask based on which SARMUX pin is used.
		 * Each SARMUX pin (0-7) has a dedicated hardware switch that connects
		 * the pin to the SAR ADC input multiplexer.
		 *
		 * The switch mask bits enable the physical analog switches in the SAR MUX.
		 * These switches are controlled by the SAR_MUX_SWITCH registers.
		 */
		switch (channel_cfg->input_positive) {
		case 0:
			sw_mask |= CY_SAR_MUX_FW_P0_VPLUS;
			break;
		case 1:
			sw_mask |= CY_SAR_MUX_FW_P1_VPLUS;
			break;
		case 2:
			sw_mask |= CY_SAR_MUX_FW_P2_VPLUS;
			break;
		case 3:
			sw_mask |= CY_SAR_MUX_FW_P3_VPLUS;
			break;
		case 4:
			sw_mask |= CY_SAR_MUX_FW_P4_VPLUS;
			break;
		case 5:
			sw_mask |= CY_SAR_MUX_FW_P5_VPLUS;
			break;
		case 6:
			sw_mask |= CY_SAR_MUX_FW_P6_VPLUS;
			break;
		case 7:
			sw_mask |= CY_SAR_MUX_FW_P7_VPLUS;
			break;
		default:
			LOG_ERR("Channel %u: Invalid SARMUX pin %u in switch (global pin %u)", ch,
				gpio_pin, channel_cfg->input_positive);
			return -EINVAL;
		}

	} else if (data->channel_cfg[ch].vplus_routing == PSOC4_ADC_ROUTE_AMUXBUS_A ||
		   data->channel_cfg[ch].vplus_routing == PSOC4_ADC_ROUTE_AMUXBUS_B) {

		/* Calculate GPIO port and pin number within that port */
		uint32_t port = psoc4_get_gpio_port(channel_cfg->input_positive,
						    data->channel_cfg[ch].vplus_routing);
		uint32_t gpio_pin = channel_cfg->input_positive % PSOC4_ADC_GPIO_PINS_PER_PORT;

		GPIO_PRT_Type *port_base = Cy_GPIO_PortToAddr(port);

		if (!port_base) {
			LOG_ERR("Channel %u: Cannot get GPIO port %u for AMUXBUS pin %u", ch, port,
				channel_cfg->input_positive);
			return -EINVAL;
		}

		/*
		 * Configure AMUXBUS splitter cells to route analog signal to SAR ADC.
		 * The splitter connects the AMUXBUS line to the global resource (GLR)
		 * which routes to the SAR ADC input.
		 */
		psoc4_configure_amuxbus_splitter(data->channel_cfg[ch].vplus_routing, port);

		Cy_GPIO_SetDrivemode(port_base, gpio_pin, CY_GPIO_DM_ANALOG);

		/*
		 * Configure HSIOM (High-Speed I/O Matrix) to connect GPIO pin to AMUXBUS.
		 * HSIOM_SEL_AMUXA routes to AMUXBUS A, HSIOM_SEL_AMUXB routes to AMUXBUS B.
		 */
		en_hsiom_sel_t hsiom_sel =
			(data->channel_cfg[ch].vplus_routing == PSOC4_ADC_ROUTE_AMUXBUS_A)
				? HSIOM_SEL_AMUXA
				: HSIOM_SEL_AMUXB;
		Cy_GPIO_SetHSIOM(port_base, gpio_pin, hsiom_sel);

		sw_mask |= (data->channel_cfg[ch].vplus_routing == PSOC4_ADC_ROUTE_AMUXBUS_A)
				   ? CY_SAR_MUX_FW_AMUXBUSA_VPLUS
				   : CY_SAR_MUX_FW_AMUXBUSB_VPLUS;
	} else {
		LOG_ERR("Channel %u: Unknown routing type for positive input pin %u", ch,
			channel_cfg->input_positive);
		return -EINVAL;
	}

	/* configuration for Negative input (differential only) */
	if (channel_cfg->differential) {

