zephyrproject-rtos/zephyr/drivers/adc/adc_infineon_psoc4_sar.c
		data->channel_cfg[ch].vminus = channel_cfg->input_negative;
		data->channel_cfg[ch].vminus_routing =
			psoc4_determine_routing(channel_cfg->input_negative);

		/* positive input and negative input must use compatible routing */
		bool routing_mismatch = false;

		if (data->channel_cfg[ch].vplus_routing == PSOC4_ADC_ROUTE_SARMUX) {
			if (data->channel_cfg[ch].vminus_routing != PSOC4_ADC_ROUTE_SARMUX) {
				routing_mismatch = true;
			}
		} else {
			if (data->channel_cfg[ch].vminus_routing == PSOC4_ADC_ROUTE_SARMUX) {
				routing_mismatch = true;
			} else if (data->channel_cfg[ch].vplus_routing ==
				   data->channel_cfg[ch].vminus_routing) {
				routing_mismatch = true;
			}
		}

		if (routing_mismatch) {
			LOG_ERR("Channel %u: positive input and negative input routing mismatch",
				ch);
			return -EINVAL;
		}

		if (data->channel_cfg[ch].vminus_routing == PSOC4_ADC_ROUTE_SARMUX) {

			if (channel_cfg->input_negative > PSOC4_ADC_SARMUX_PIN_MAX) {
				LOG_ERR("Channel %u: SARMUX negative input pin %u > max %u", ch,
					channel_cfg->input_negative, PSOC4_ADC_SARMUX_PIN_MAX);
				return -EINVAL;
			}

			uint32_t port = psoc4_get_gpio_port(channel_cfg->input_negative,
							    PSOC4_ADC_ROUTE_SARMUX);
			/* SARMUX pins are on port 2, pins 0-7 directly mapped */
			uint32_t gpio_pin = channel_cfg->input_negative;

			GPIO_PRT_Type *port_base = Cy_GPIO_PortToAddr(port);

			if (!port_base) {
				LOG_ERR("Channel %u: Cannot get GPIO port for negative input pin "
					"%u",
					ch, channel_cfg->input_negative);
				return -EINVAL;
			}

			Cy_GPIO_SetDrivemode(port_base, gpio_pin, CY_GPIO_DM_ANALOG);

			switch (channel_cfg->input_negative) {
			case 0:
				sw_mask |= CY_SAR_MUX_FW_P0_VMINUS;
				break;
			case 1:
				sw_mask |= CY_SAR_MUX_FW_P1_VMINUS;
				break;
			case 2:
				sw_mask |= CY_SAR_MUX_FW_P2_VMINUS;
				break;
			case 3:
				sw_mask |= CY_SAR_MUX_FW_P3_VMINUS;
				break;
			case 4:
				sw_mask |= CY_SAR_MUX_FW_P4_VMINUS;
				break;
			case 5:
				sw_mask |= CY_SAR_MUX_FW_P5_VMINUS;
				break;
			case 6:
				sw_mask |= CY_SAR_MUX_FW_P6_VMINUS;
				break;
			case 7:
				sw_mask |= CY_SAR_MUX_FW_P7_VMINUS;
				break;
			default:
				LOG_ERR("Channel %u: Invalid SARMUX negative input pin %u in "
					"switch (global "
					"pin %u)",
					ch, gpio_pin, channel_cfg->input_negative);
				return -EINVAL;
			}
		} else if (data->channel_cfg[ch].vminus_routing == PSOC4_ADC_ROUTE_AMUXBUS_A ||
			   data->channel_cfg[ch].vminus_routing == PSOC4_ADC_ROUTE_AMUXBUS_B) {

			/* Calculate GPIO port and pin number within that port */
			uint32_t port = psoc4_get_gpio_port(channel_cfg->input_negative,
							    data->channel_cfg[ch].vminus_routing);
			uint32_t gpio_pin =
				channel_cfg->input_negative % PSOC4_ADC_GPIO_PINS_PER_PORT;

			GPIO_PRT_Type *port_base = Cy_GPIO_PortToAddr(port);

			if (!port_base) {
				LOG_ERR("Channel %u: Cannot get GPIO port %u for AMUXBUS negative "
					"input pin %u",
					ch, port, channel_cfg->input_negative);
				return -EINVAL;
			}

			/* Configure AMUXBUS splitter cells */
			psoc4_configure_amuxbus_splitter(data->channel_cfg[ch].vminus_routing,
							 port);

			Cy_GPIO_SetDrivemode(port_base, gpio_pin, CY_GPIO_DM_ANALOG);

			/* Configure HSIOM to connect GPIO pin to AMUXBUS */
			en_hsiom_sel_t hsiom_sel =
				(data->channel_cfg[ch].vminus_routing == PSOC4_ADC_ROUTE_AMUXBUS_A)
					? HSIOM_SEL_AMUXA
					: HSIOM_SEL_AMUXB;
			Cy_GPIO_SetHSIOM(port_base, gpio_pin, hsiom_sel);

			sw_mask |=
				(data->channel_cfg[ch].vminus_routing == PSOC4_ADC_ROUTE_AMUXBUS_A)
					? CY_SAR_MUX_FW_AMUXBUSA_VMINUS
					: CY_SAR_MUX_FW_AMUXBUSB_VMINUS;
		}
	}

	/* Check if any switches were configured */
	if (sw_mask == 0) {
		LOG_ERR("Channel %u: No SAR switches configured", ch);
		return -EINVAL;
	}

	data->channel_cfg[ch].sw_mask = sw_mask;
	data->channel_cfg[ch].reference = channel_cfg->reference;

	/* Acquisition time handling */

	/* Number of ADC clock ticks for sampling */
	uint32_t ticks = psoc4_calculate_acq_ticks(channel_cfg->acquisition_time);

	/*
	 * Find an available sample time slot (0-3).
	 * PSoC4 has 4 hardware sample time registers that can be shared between channels.
	 * This allows different channels to have different acquisition times.
	 */
	uint8_t sample_time_idx = psoc4_find_sample_time_idx(data, ticks);

	/* Check if we found an available sample time slot */
	if (sample_time_idx == PSOC4_ADC_INVALID_SAMPLE_TIME) {
		LOG_ERR("Channel %u: No available sample time slots", ch);
		return -EINVAL;
	}

	/* Store which sample time slot this channel will use (0-3) */
	data->channel_cfg[ch].sample_time_idx = sample_time_idx;
	data->channels_mask |= BIT(ch);

	LOG_DBG("Channel %u configured: positive input pin %u, %s, sw_mask=0x%08x", ch,
		channel_cfg->input_positive,
		channel_cfg->differential ? "differential" : "single-ended", sw_mask);

	return 0;
}

static int validate_buffer_size(const struct adc_sequence *sequence)
{
	size_t active_channels = 0;
	size_t required_buffer_size;

	for (int i = 0; i < CY_SAR_SEQ_NUM_CHANNELS; i++) {
		if (sequence->channels & BIT(i)) {
			active_channels++;
		}
	}

	required_buffer_size = active_channels * sizeof(uint16_t);

	if (sequence->options) {
		required_buffer_size *= (1 + sequence->options->extra_samplings);
	}

	if (sequence->buffer_size < required_buffer_size) {
		LOG_ERR("Buffer too small: need %zu, got %zu", required_buffer_size,
			sequence->buffer_size);
		return -ENOMEM;
	}

	return 0;
}

static void psoc4_map_oversampling(cy_stc_sar_config_t *cfg, uint8_t oversampling)
{
	if (oversampling == 0) {
		cfg->avgCnt = CY_SAR_AVG_CNT_2;

		/* No right shift of result */
		cfg->avgShift = false;
		return;
	}

	/* For oversampling > 0, enable result shifting (divide by N) */
	cfg->avgShift = true;

	/* Map oversampling value (1-8 from overlay) to hardware averaging count */
	switch (oversampling) {
	case 1:
		cfg->avgCnt = CY_SAR_AVG_CNT_2;
		break;
	case 2:
		cfg->avgCnt = CY_SAR_AVG_CNT_4;
		break;
	case 3:
		cfg->avgCnt = CY_SAR_AVG_CNT_8;
		break;
	case 4:
		cfg->avgCnt = CY_SAR_AVG_CNT_16;
		break;
	case 5:
		cfg->avgCnt = CY_SAR_AVG_CNT_32;
		break;
	case 6:
		cfg->avgCnt = CY_SAR_AVG_CNT_64;
		break;
	case 7:
		cfg->avgCnt = CY_SAR_AVG_CNT_128;
		break;
	case 8:
		cfg->avgCnt = CY_SAR_AVG_CNT_256;
		break;
	default:
		cfg->avgCnt = CY_SAR_AVG_CNT_2;
		cfg->avgShift = false;
		break;
	}
}

