zephyrproject-rtos/zephyr/drivers/adc/adc_infineon_psoc4_sar.c
/* Configure ADC reference voltage */
static void psoc4_configure_reference(struct psoc4_adc_data *data,
				      const struct psoc4_adc_config *cfg)
{
	uint32_t vref_mv = cfg->vref_mv;

	switch (cfg->vref_src) {
	case PSOC4_ADC_VREF_INTERNAL:
		data->pdl_sar_cfg.vrefSel = CY_SAR_VREF_SEL_BGR;
		data->pdl_sar_cfg.vrefMvValue = PSOC4_ADC_REF_INTERNAL_MV;
		break;
	case PSOC4_ADC_VREF_VDDA:
		data->pdl_sar_cfg.vrefSel = CY_SAR_VREF_SEL_VDDA;
		data->pdl_sar_cfg.vrefMvValue = vref_mv;
		break;
	case PSOC4_ADC_VREF_VDDA_DIV_2:
		data->pdl_sar_cfg.vrefSel = CY_SAR_VREF_SEL_VDDA_DIV_2;
		data->pdl_sar_cfg.vrefMvValue = vref_mv / 2;
		break;
	case PSOC4_ADC_VREF_EXT:
		data->pdl_sar_cfg.vrefSel = CY_SAR_VREF_SEL_EXT;
		data->pdl_sar_cfg.vrefMvValue = vref_mv;
		break;
	default:
		LOG_ERR("Unsupported VREF source, using Internal");
		data->pdl_sar_cfg.vrefSel = CY_SAR_VREF_SEL_BGR;
		data->pdl_sar_cfg.vrefMvValue = PSOC4_ADC_REF_INTERNAL_MV;
		break;
	}
}

/* Configure ADC sample times */
static void psoc4_configure_sample_times(struct psoc4_adc_data *data)
{
	data->pdl_sar_cfg.sampleTime0 = data->sample_times[0] ? data->sample_times[0] : 3;
	data->pdl_sar_cfg.sampleTime1 = data->sample_times[1] ? data->sample_times[1] : 3;
	data->pdl_sar_cfg.sampleTime2 = data->sample_times[2] ? data->sample_times[2] : 3;
	data->pdl_sar_cfg.sampleTime3 = data->sample_times[3] ? data->sample_times[3] : 3;
}

static void psoc4_adc_configure_pdl(struct psoc4_adc_data *data,
				    const struct adc_sequence *sequence,
				    const struct psoc4_adc_config *cfg)
{
	bool has_differential = false;
	bool has_12bit = false;

	/* Initialize with defaults */
	data->pdl_sar_cfg = psoc4_sar_pdl_cfg_struct_default;

	/* Configure reference voltage */
	psoc4_configure_reference(data, cfg);

	/* Configure sample times */
	psoc4_configure_sample_times(data);

	/* Configure oversampling */
	psoc4_map_oversampling(&data->pdl_sar_cfg, sequence->oversampling);

	/* Configure channels */
	data->pdl_sar_cfg.chanEn = sequence->channels;

	for (int ch = 0; ch < CY_SAR_SEQ_NUM_CHANNELS; ch++) {
		if (!(sequence->channels & BIT(ch))) {
			data->pdl_sar_cfg.channelConfig[ch] = NULL;
			continue;
		}

		data->resolution[ch] = sequence->resolution;
		const struct psoc4_adc_channel_cfg *ch_cfg = &data->channel_cfg[ch];

		/* Check for differential mode */
		if (ch_cfg->differential) {
			has_differential = true;
		}

		/* Check for 12-bit resolution */
		if (sequence->resolution == 12) {
			has_12bit = true;
		}

		/* Calculate SAR address for positive input */
		cy_en_sar_chan_config_port_pin_addr_t vplus_addr;

		if (ch_cfg->vplus_routing == PSOC4_ADC_ROUTE_SARMUX) {
			if (ch_cfg->vplus > PSOC4_ADC_SARMUX_PIN_MAX) {
				LOG_ERR("Invalid SARMUX pin number: %d", ch_cfg->vplus);
				return;
			}
			vplus_addr = (cy_en_sar_chan_config_port_pin_addr_t)(CY_SAR_ADDR_SARMUX_0 +
									     ch_cfg->vplus);
		} else if (ch_cfg->vplus_routing == PSOC4_ADC_ROUTE_AMUXBUS_A) {
			vplus_addr = CY_SAR_ADDR_SARMUX_AMUXBUS_A;
		} else if (ch_cfg->vplus_routing == PSOC4_ADC_ROUTE_AMUXBUS_B) {
			vplus_addr = CY_SAR_ADDR_SARMUX_AMUXBUS_B;
		} else {
			LOG_ERR("Unsupported positive input routing type: %d",
				ch_cfg->vplus_routing);
			return;
		}

		/* Calculate SAR address for negative input (differential only) */
#if (defined(CY_IP_M0S8PASS4A_SAR_VERSION) && (4U <= CY_IP_M0S8PASS4A_SAR_VERSION))
		cy_en_sar_chan_config_neg_port_pin_addr_t vminus_addr = 0;
		bool vminus_addr_en = false;

		if (ch_cfg->differential) {
			if (ch_cfg->vminus_routing == PSOC4_ADC_ROUTE_SARMUX) {
				if (ch_cfg->vminus > PSOC4_ADC_SARMUX_PIN_MAX) {
					LOG_ERR("Invalid SARMUX negative input pin number: %d",
						ch_cfg->vminus);
					return;
				}
				uint32_t temp_addr = CY_SAR_NEG_ADDR_SARMUX_0 + ch_cfg->vminus;

				vminus_addr = (cy_en_sar_chan_config_neg_port_pin_addr_t)temp_addr;
				vminus_addr_en = true;
			} else if (ch_cfg->vminus_routing == PSOC4_ADC_ROUTE_AMUXBUS_A) {
				vminus_addr = CY_SAR_NEG_ADDR_SARMUX_AMUXBUS_A;
				vminus_addr_en = true;
			} else if (ch_cfg->vminus_routing == PSOC4_ADC_ROUTE_AMUXBUS_B) {
				vminus_addr = CY_SAR_NEG_ADDR_SARMUX_AMUXBUS_B;
				vminus_addr_en = true;
			} else {
				LOG_ERR("Unsupported negative input routing type: %d",
					ch_cfg->vminus_routing);
				return;
			}
		}
#endif

		/* Configure channel structure */
		data->channel_configs[ch] = psoc4_default_channel_cfg;
		data->channel_configs[ch].addr = vplus_addr;
		data->channel_configs[ch].differential = ch_cfg->differential;
		data->channel_configs[ch].avgEn = (sequence->oversampling > 0);
		data->channel_configs[ch].resolution =
			(sequence->resolution == 12) ? CY_SAR_MAX_RES : CY_SAR_SUB_RES;
		data->channel_configs[ch].sampleTimeSel =
			(cy_en_sar_channel_sampletime_t)ch_cfg->sample_time_idx;

#if (defined(CY_IP_M0S8PASS4A_SAR_VERSION) && (4U <= CY_IP_M0S8PASS4A_SAR_VERSION))
		if (ch_cfg->differential && vminus_addr_en) {
			data->channel_configs[ch].neg_addr = vminus_addr;
			data->channel_configs[ch].negAddrEn = true;
		} else {
			data->channel_configs[ch].negAddrEn = false;
		}
#endif

		data->pdl_sar_cfg.channelConfig[ch] = &data->channel_configs[ch];
	}

	/* Set differential mode */
	data->pdl_sar_cfg.differentialSigned = has_differential;

	/*  Set Sub-resolution */
	if (has_12bit) {
		data->pdl_sar_cfg.subResolution = CY_SAR_SUB_RESOLUTION_10B;
	} else if (sequence->resolution == 10) {
		data->pdl_sar_cfg.subResolution = CY_SAR_SUB_RESOLUTION_10B;
	} else {
		data->pdl_sar_cfg.subResolution = CY_SAR_SUB_RESOLUTION_8B;
	}
}

static void psoc4_adc_set_switches(struct psoc4_adc_data *data, const struct adc_sequence *sequence,
				   const struct psoc4_adc_config *cfg)
{
	uint32_t total_sw_mask = 0;
	uint32_t hw_ctrl_mask = 0;
	bool has_differential = false;

	/* Calculate switch masks for both firmware and hardware control */
	for (int ch = 0; ch < CY_SAR_SEQ_NUM_CHANNELS; ch++) {
		if (sequence->channels & BIT(ch)) {
			const struct psoc4_adc_channel_cfg *ch_cfg = &data->channel_cfg[ch];

			total_sw_mask |= ch_cfg->sw_mask;

