zephyrproject-rtos/zephyr/drivers/adc/adc_infineon_psoc4_sar.c
			if (ch_cfg->differential) {
				has_differential = true;
			}

			/* Enable SARSEQ hardware control for multi-channel sequences */
			if (ch_cfg->vplus_routing == PSOC4_ADC_ROUTE_SARMUX) {
				/* SARMUX pins 0-7: Enable hardware control for the pin */
				hw_ctrl_mask |= SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_P0_Msk
						<< ch_cfg->vplus;
			} else if (ch_cfg->vplus_routing == PSOC4_ADC_ROUTE_AMUXBUS_A) {
				hw_ctrl_mask |= SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_AMUXBUSA_Msk;
			} else if (ch_cfg->vplus_routing == PSOC4_ADC_ROUTE_AMUXBUS_B) {
				hw_ctrl_mask |= SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_AMUXBUSB_Msk;
			}

			/* Handle negative input hardware control for differential mode */
			if (ch_cfg->differential) {
				if (ch_cfg->vminus_routing == PSOC4_ADC_ROUTE_SARMUX) {
					hw_ctrl_mask |= SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_P0_Msk
							<< ch_cfg->vminus;
				} else if (ch_cfg->vminus_routing == PSOC4_ADC_ROUTE_AMUXBUS_A) {
					hw_ctrl_mask |=
						SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_AMUXBUSA_Msk;
				} else if (ch_cfg->vminus_routing == PSOC4_ADC_ROUTE_AMUXBUS_B) {
					hw_ctrl_mask |=
						SAR_MUX_SWITCH_HW_CTRL_MUX_HW_CTRL_AMUXBUSB_Msk;
				}
			}
		}
	}

	/* Define all possible analog switches */
	uint32_t all_switches =
		CY_SAR_MUX_FW_P0_VPLUS | CY_SAR_MUX_FW_P1_VPLUS | CY_SAR_MUX_FW_P2_VPLUS |
		CY_SAR_MUX_FW_P3_VPLUS | CY_SAR_MUX_FW_P4_VPLUS | CY_SAR_MUX_FW_P5_VPLUS |
		CY_SAR_MUX_FW_P6_VPLUS | CY_SAR_MUX_FW_P7_VPLUS | CY_SAR_MUX_FW_AMUXBUSA_VPLUS |
		CY_SAR_MUX_FW_AMUXBUSB_VPLUS | CY_SAR_MUX_FW_P0_VMINUS | CY_SAR_MUX_FW_P1_VMINUS |
		CY_SAR_MUX_FW_P2_VMINUS | CY_SAR_MUX_FW_P3_VMINUS | CY_SAR_MUX_FW_P4_VMINUS |
		CY_SAR_MUX_FW_P5_VMINUS | CY_SAR_MUX_FW_P6_VMINUS | CY_SAR_MUX_FW_P7_VMINUS |
		CY_SAR_MUX_FW_AMUXBUSA_VMINUS | CY_SAR_MUX_FW_AMUXBUSB_VMINUS;

	/* Turn off all switches first */
	Cy_SAR_SetAnalogSwitch(cfg->base, all_switches, false);

	/* Turn on the needed switches via firmware */
	if (total_sw_mask != 0) {
		Cy_SAR_SetAnalogSwitch(cfg->base, total_sw_mask, true);
	}

	/*
	 * Enable SARSEQ (hardware sequencer) control of the switches.
	 * This allows the SAR hardware to automatically manage switch selection
	 * per channel during multi-channel sequences, overriding firmware control
	 * to prevent crosstalk by ensuring only one channel's switches are active
	 * at a time during conversion.
	 */
#ifdef CONFIG_ADC_INFINEON_PSOC4_SARSEQ_SWITCHING
	if (hw_ctrl_mask != 0) {
		Cy_SAR_SetSwitchSarSeqCtrl(cfg->base, hw_ctrl_mask, true);
	}
#endif
	/* Configure VSSA_VMINUS switch based on differential mode */
	if (has_differential) {
		Cy_SAR_SetAnalogSwitch(cfg->base, SAR_MUX_SWITCH0_MUX_FW_VSSA_VMINUS_Msk, false);
	} else {
		Cy_SAR_SetAnalogSwitch(cfg->base, SAR_MUX_SWITCH0_MUX_FW_VSSA_VMINUS_Msk, true);
	}
}

static int start_read(const struct device *dev, const struct adc_sequence *sequence)
{
	struct psoc4_adc_data *data = dev->data;
	const struct psoc4_adc_config *cfg = dev->config;
	cy_en_sar_status_t sar_status;

	if (sequence->channels == 0) {
		LOG_ERR("No channels selected");
		return -EINVAL;
	}

	uint32_t unconfigured = sequence->channels & ~data->channels_mask;

	if (unconfigured) {
		LOG_ERR("Channel(s) 0x%08x not configured", unconfigured);
		return -EINVAL;
	}

	/* Validate oversampling */
	if (sequence->oversampling > 8) {
		LOG_ERR("Invalid oversampling: %d", sequence->oversampling);
		return -EINVAL;
	}

	/* Validate ADC resolution setting */
	if (sequence->resolution != 8 && sequence->resolution != 10 && sequence->resolution != 12) {
		LOG_ERR("Invalid resolution: %d", sequence->resolution);
		return -EINVAL;
	}

	int buffer_check = validate_buffer_size(sequence);

	if (buffer_check < 0) {
		return buffer_check;
	}

	/* Configure PDL Structure */
	psoc4_adc_configure_pdl(data, sequence, cfg);

	/* Initialize SAR Hardware */
	Cy_SAR_Disable(cfg->base);
	sar_status = Cy_SAR_Init(cfg->base, &data->pdl_sar_cfg);
	if (sar_status != CY_SAR_SUCCESS) {
		LOG_ERR("Failed to initialize SAR ADC: %d", sar_status);
		return -EIO;
	}

	Cy_SAR_Enable(cfg->base);
	Cy_SAR_SetInterruptMask(cfg->base, CY_SAR_INTR_EOS);

	/* Configure Analog Switches */
	psoc4_adc_set_switches(data, sequence, cfg);

	/* Start Conversion */
	data->channels = sequence->channels;
	data->buffer = sequence->buffer;

	adc_context_start_read(&data->ctx, sequence);
	return adc_context_wait_for_completion(&data->ctx);
}

static int psoc4_adc_read(const struct device *dev, const struct adc_sequence *sequence)
{
	int ret;
	struct psoc4_adc_data *data = dev->data;

	adc_context_lock(&data->ctx, false, NULL);
	ret = start_read(dev, sequence);
	adc_context_release(&data->ctx, ret);
	return ret;
}

#ifdef CONFIG_ADC_ASYNC
static int psoc4_adc_read_async(const struct device *dev, const struct adc_sequence *sequence,
				struct k_poll_signal *async)
{
	int ret;
	struct psoc4_adc_data *data = dev->data;

	adc_context_lock(&data->ctx, true, async);
	ret = start_read(dev, sequence);
	adc_context_release(&data->ctx, ret);

	return ret;
}
#endif

static void psoc4_adc_isr(const struct device *dev)
{
	struct psoc4_adc_data *data = dev->data;
	const struct psoc4_adc_config *cfg = dev->config;
	uint32_t intr;

	intr = Cy_SAR_GetInterruptStatus(cfg->base);

	if (!(intr & CY_SAR_INTR_EOS)) {
		return;
	}

	for (uint8_t ch = 0; ch < CY_SAR_SEQ_NUM_CHANNELS; ch++) {
		if (data->channels & BIT(ch)) {

			/* Get raw 16-bit ADC result (signed or unsigned) */
			int16_t raw = Cy_SAR_GetResult16(cfg->base, ch);
			uint16_t result;

			/* Process based on channel mode */
			if (data->channel_cfg[ch].differential) {

				/* DIFFERENTIAL MODE: Cast signed to unsigned directly */
				result = (uint16_t)(int16_t)raw;
			} else {

				/* SINGLE-ENDED MODE: Handle negative values (shouldn't occur) */
				if (raw < 0) {
					result = 0;
				} else {
					uint8_t res_bits = data->resolution[ch];
					uint16_t mask = (res_bits == 12) ? 0x0FFF /* 12-bit mask */
							: (res_bits == 10)
								? 0x03FF  /* 10-bit mask */
								: 0x00FF; /* 8-bit mask */
					result = (uint16_t)raw & mask;
				}
			}
			*data->buffer++ = result;
		}
	}

	Cy_SAR_ClearInterrupt(cfg->base, CY_SAR_INTR_EOS);
	adc_context_on_sampling_done(&data->ctx, dev);
}

/* ADC device driver initialization function */
static int psoc4_adc_init(const struct device *dev)
{
	struct psoc4_adc_data *data = dev->data;
	const struct psoc4_adc_config *cfg = dev->config;
	cy_en_sar_status_t sar_status;

	data->dev = dev;

