zephyrproject-rtos/zephyr/drivers/adc/adc_infineon_psoc4_sar.c
	int rslt = ifx_cat1_utils_peri_pclk_assign_divider(cfg->clk_dst, &data->clock);

	if (rslt != CY_RSLT_SUCCESS) {
		return -EIO;
	}

	/* Initialize SAR configuration with defaults */
	data->pdl_sar_cfg = psoc4_sar_pdl_cfg_struct_default;

	/* Initialize SAR ADC */
	sar_status = Cy_SAR_Init(cfg->base, &data->pdl_sar_cfg);
	if (sar_status != CY_SAR_SUCCESS) {
		LOG_ERR("Failed to initialize SAR ADC: %d", sar_status);
		return -EIO;
	}

	Cy_SAR_SetInterruptMask(cfg->base, CY_SAR_INTR_EOS);

	/* Enable the SAR ADC hardware */
	Cy_SAR_Enable(cfg->base);

	cfg->irq_func(dev);
	adc_context_unlock_unconditionally(&data->ctx);

	return 0;
}

static const struct adc_driver_api adc_psoc4_driver_api = {
	.channel_setup = psoc4_adc_channel_setup,
	.read = psoc4_adc_read,
#ifdef CONFIG_ADC_ASYNC
	.read_async = psoc4_adc_read_async,
#endif
	.ref_internal = PSOC4_ADC_REF_INTERNAL_MV,
};

#define ADC_PERI_CLOCK_INIT(n)                                                                     \
	.clock = {                                                                                 \
		.block = IFX_CAT1_PERIPHERAL_GROUP_ADJUST(                                         \
			DT_PROP_BY_IDX(DT_INST_PHANDLE(n, clocks), peri_group, 1),                 \
			DT_INST_PROP_BY_PHANDLE(n, clocks, div_type)),                             \
		.channel = DT_INST_PROP_BY_PHANDLE(n, clocks, channel),                            \
	}

#define INFINEON_PSOC4_ADC_INIT(n)                                                                 \
	static void psoc4_adc_config_func_##n(const struct device *dev)                            \
	{                                                                                          \
		IRQ_CONNECT(DT_INST_IRQN(n), DT_INST_IRQ(n, priority), psoc4_adc_isr,              \
			    DEVICE_DT_INST_GET(n), 0);                                             \
		irq_enable(DT_INST_IRQN(n));                                                       \
	}                                                                                          \
	static struct psoc4_adc_data psoc4_adc_data_##n = {                                        \
		ADC_CONTEXT_INIT_TIMER(psoc4_adc_data_##n, ctx),                                   \
		ADC_CONTEXT_INIT_LOCK(psoc4_adc_data_##n, ctx),                                    \
		ADC_CONTEXT_INIT_SYNC(psoc4_adc_data_##n, ctx), ADC_PERI_CLOCK_INIT(n)};           \
	static const struct psoc4_adc_config psoc4_adc_cfg_##n = {                                 \
		.base = (SAR_Type *)DT_INST_REG_ADDR(n),                                           \
		.irq_func = psoc4_adc_config_func_##n,                                             \
		.vref_src = DT_INST_ENUM_IDX(n, vref_src),                                         \
		.vref_mv = DT_INST_PROP(n, vref_mv),                                               \
		.clk_dst = (en_clk_dst_t)DT_INST_PROP(n, clk_dst),                                 \
	};                                                                                         \
	DEVICE_DT_INST_DEFINE(n, psoc4_adc_init, NULL, &psoc4_adc_data_##n, &psoc4_adc_cfg_##n,    \
			      POST_KERNEL, CONFIG_ADC_INIT_PRIORITY, &adc_psoc4_driver_api);

DT_INST_FOREACH_STATUS_OKAY(INFINEON_PSOC4_ADC_INIT)
